In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]

'aardvark'

In [6]:
string_data[0]=None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned = data.dropna()

In [16]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[4] = NA

In [20]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df = pd.DataFrame(np.random.randn(7, 3))

In [23]:
df

          0         1         2
0 -1.220665 -0.979175  0.830360
1 -1.646262 -0.528791  0.566361
2  0.495197  0.794730  0.289025
3 -0.495290 -0.308019  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [24]:
df.iloc[:4, 1] = NA

In [25]:
df

          0         1         2
0 -1.220665       NaN  0.830360
1 -1.646262       NaN  0.566361
2  0.495197       NaN  0.289025
3 -0.495290       NaN  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [26]:
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0 -1.220665       NaN       NaN
1 -1.646262       NaN       NaN
2  0.495197       NaN  0.289025
3 -0.495290       NaN  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [28]:
df.dropna()

          0         1         2
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [29]:
df.dropna(thresh=2)

          0         1         2
2  0.495197       NaN  0.289025
3 -0.495290       NaN  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [30]:
df.fillna(0)

          0         1         2
0 -1.220665  0.000000  0.000000
1 -1.646262  0.000000  0.000000
2  0.495197  0.000000  0.289025
3 -0.495290  0.000000  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [31]:
df

          0         1         2
0 -1.220665       NaN       NaN
1 -1.646262       NaN       NaN
2  0.495197       NaN  0.289025
3 -0.495290       NaN  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [32]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.220665  0.500000  0.000000
1 -1.646262  0.500000  0.000000
2  0.495197  0.500000  0.289025
3 -0.495290  0.500000  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [33]:
_ = df.fillna(0, inplace=True)

In [34]:
df

          0         1         2
0 -1.220665  0.000000  0.000000
1 -1.646262  0.000000  0.000000
2  0.495197  0.000000  0.289025
3 -0.495290  0.000000  0.671618
4 -0.743058  0.879987 -0.486373
5  0.434223 -0.619920  0.125621
6  2.084010  0.678532  0.432207

In [35]:
df = pd.DataFrame(np.random.randn(6, 3))

In [36]:
df

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263  0.005149  0.189477
3  0.447029 -1.297578  1.167959
4 -0.541240 -0.006341  0.425254
5  0.139830 -0.184851 -0.983180

In [37]:
df.iloc[2:, 1] = NA

In [38]:
df

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263       NaN  0.189477
3  0.447029       NaN  1.167959
4 -0.541240       NaN  0.425254
5  0.139830       NaN -0.983180

In [39]:
df.iloc[4:, 2] = NA

In [40]:
df

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263       NaN  0.189477
3  0.447029       NaN  1.167959
4 -0.541240       NaN       NaN
5  0.139830       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263  1.190097  0.189477
3  0.447029  1.190097  1.167959
4 -0.541240  1.190097  1.167959
5  0.139830  1.190097  1.167959

In [42]:
df

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263       NaN  0.189477
3  0.447029       NaN  1.167959
4 -0.541240       NaN       NaN
5  0.139830       NaN       NaN

In [43]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.717685  3.000909  0.226009
1  0.070549  1.190097 -0.704600
2 -0.033263  1.190097  0.189477
3  0.447029  1.190097  1.167959
4 -0.541240       NaN  1.167959
5  0.139830       NaN  1.167959

In [44]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [45]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [46]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [47]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [48]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [50]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data['v1'] = range(7)

In [52]:
data.drop_duplicates(['k1','k2','v1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [53]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [54]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [55]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 
                              'Bacon','pastrami', 'honey ham', 'nova lox'], 
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [56]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [57]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

In [58]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [59]:
lowercased = data['food'].str.lower()

In [60]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [61]:
data['animal'] = lowercased.map(meat_to_animal)

In [62]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [63]:
data['animal2']=data['food'].map(lambda x: meat_to_animal[x.lower()])

In [64]:
data

          food  ounces  animal animal2
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [65]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [66]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace(-999, 0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       3.0
dtype: float64

In [68]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [69]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [71]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [72]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [73]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [74]:
transform = lambda x: x[:5].upper()

In [75]:
transform

In [76]:
data.index.map(transform)

Index(['OHIO', 'COLOR', 'NEW Y'], dtype='object')

In [77]:
data.index = data.index.map(transform)

In [78]:
data

       one  two  three  four
OHIO     0    1      2     3
COLOR    4    5      6     7
NEW Y    8    9     10    11

In [79]:
data.rename(index=str.title, columns=str.upper)

       ONE  TWO  THREE  FOUR
Ohio     0    1      2     3
Color    4    5      6     7
New Y    8    9     10    11

In [80]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLOR      4    5         6     7
NEW Y      8    9        10    11

In [81]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [82]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLOR      4    5      6     7
NEW Y      8    9     10    11

In [83]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [84]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [85]:
bins = [18, 25, 35, 60, 100]

In [86]:
cats = pd.cut(ages, bins)

In [87]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [88]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [89]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [90]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [91]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [92]:
group_names

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [93]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [94]:
data = np.random.rand(20)

In [95]:
data

array([0.76888449, 0.76485467, 0.20270342, 0.52092565, 0.09304196,
       0.39762554, 0.34470525, 0.02161667, 0.99508233, 0.86573092,
       0.71126888, 0.59699258, 0.14560576, 0.82005436, 0.4489958 ,
       0.42948271, 0.61568666, 0.33904382, 0.94087179, 0.14037577])

In [96]:
pd.cut(data, 4, precision=2)

[(0.75, 1.0], (0.75, 1.0], (0.021, 0.26], (0.51, 0.75], (0.021, 0.26], ..., (0.26, 0.51], (0.51, 0.75], (0.26, 0.51], (0.75, 1.0], (0.021, 0.26]]
Length: 20
Categories (4, interval[float64]): [(0.021, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 1.0]]

In [97]:
data = np.random.randn(1000)

In [98]:
cats = pd.qcut(data, 4)

In [99]:
cats

[(-0.676, 0.0295], (0.0295, 0.689], (-0.676, 0.0295], (0.689, 3.332], (-0.676, 0.0295], ..., (-3.67, -0.676], (0.689, 3.332], (0.0295, 0.689], (-3.67, -0.676], (-3.67, -0.676]]
Length: 1000
Categories (4, interval[float64]): [(-3.67, -0.676] < (-0.676, 0.0295] < (0.0295, 0.689] < (0.689, 3.332]]

In [100]:
pd.value_counts(cats)

(0.689, 3.332]      250
(0.0295, 0.689]     250
(-0.676, 0.0295]    250
(-3.67, -0.676]     250
dtype: int64

In [101]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.207, 0.0295], (0.0295, 1.256], (-1.207, 0.0295], (0.0295, 1.256], (-1.207, 0.0295], ..., (-1.207, 0.0295], (1.256, 3.332], (0.0295, 1.256], (-3.67, -1.207], (-3.67, -1.207]]
Length: 1000
Categories (4, interval[float64]): [(-3.67, -1.207] < (-1.207, 0.0295] < (0.0295, 1.256] < (1.256, 3.332]]

In [102]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [103]:
data

            0         1         2         3
0    1.876784  0.036076  1.082875  0.575299
1   -0.232593 -1.290992 -1.725896  0.158053
2    1.266813  0.057947  2.089261  1.347629
3    1.445630  1.014331  1.900526  0.094108
4   -0.983601  0.390414  0.351015  0.835177
..        ...       ...       ...       ...
995  0.621480 -2.001199 -0.010074  1.166316
996 -0.360436  1.031564 -0.047528  0.733587
997 -0.974734 -0.297342  0.418576 -0.092466
998 -0.836066  0.427130 -0.208913 -1.435392
999  0.588490  0.961775  0.748610  0.076936

[1000 rows x 4 columns]

In [104]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034495     0.024624    -0.019414     0.001369
std       0.977037     0.993886     1.017797     0.941090
min      -2.807437    -3.961461    -3.536920    -3.061207
25%      -0.681598    -0.646558    -0.687357    -0.622427
50%       0.004567     0.022952    -0.040222     0.029978
75%       0.722476     0.668460     0.706255     0.634291
max       3.273063     3.300332     3.544271     3.285660

In [105]:
col = data[2]

In [106]:
col

0      1.082875
1     -1.725896
2      2.089261
3      1.900526
4      0.351015
         ...
995   -0.010074
996   -0.047528
997    0.418576
998   -0.208913
999    0.748610
Name: 2, Length: 1000, dtype: float64

In [107]:
col[np.abs(col) > 3]

81     3.040437
270    3.544271
540   -3.536920
Name: 2, dtype: float64

In [108]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
45   0.980969 -0.261220 -0.133249  3.285660
81   2.294665  1.251055  3.040437  0.029155
267  0.784625  1.686071  1.167892 -3.061207
270  1.360479 -0.185991  3.544271  0.297494
393  3.273063 -0.722670 -0.339967 -1.288912
397  0.365114 -3.185810  0.678291 -0.443886
495  0.915049  3.159755  2.098891  1.337871
540  1.653271 -0.660307 -3.536920 -0.819843
737 -2.463111  3.300332 -0.521836  0.704512
863  1.290077 -0.068823 -0.406052 -3.014612
970 -0.822960 -3.961461  0.964542  0.377191

In [109]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [110]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.034222     0.025311    -0.019462     0.001159
std       0.976169     0.988457     1.014192     0.939890
min      -2.807437    -3.000000    -3.000000    -3.000000
25%      -0.681598    -0.646558    -0.687357    -0.622427
50%       0.004567     0.022952    -0.040222     0.029978
75%       0.722476     0.668460     0.706255     0.634291
max       3.000000     3.000000     3.000000     3.000000

In [111]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

In [112]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [113]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [114]:
sampler = np.random.permutation(5)

In [115]:
sampler

array([0, 2, 3, 1, 4])

In [116]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [117]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3

In [118]:
choices = pd.Series([5, 7, -1, 6, 4])

In [119]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [120]:
draws = choices.sample(n=10, replace=True)

In [121]:
draws

3    6
0    5
2   -1
0    5
2   -1
0    5
1    7
2   -1
3    6
2   -1
dtype: int64

In [122]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [123]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [124]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [125]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [126]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [127]:
df_with_dummy = df[['data1']].join(dummies)

In [128]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [129]:
np.random.seed(123)

In [130]:
values = np.random.rand(10)

In [131]:
values

array([0.69646919, 0.28613933, 0.22685145, 0.55131477, 0.71946897,
       0.42310646, 0.9807642 , 0.68482974, 0.4809319 , 0.39211752])

In [132]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [133]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           1           0
1           0           1           0           0           0
2           0           1           0           0           0
3           0           0           1           0           0
4           0           0           0           1           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           1           0           0
9           0           1           0           0           0

In [134]:
val = 'a,b, guido'

In [135]:
val

'a,b, guido'

In [136]:
val.split(',')

['a', 'b', ' guido']

In [137]:
pieces = [x.strip() for x in val.split(',')]

In [138]:
pieces

['a', 'b', 'guido']

In [139]:
first, second, third = pieces

In [140]:
first + '::' + second + '::' + third

'a::b::guido'

In [141]:
'::'.join(pieces)

'a::b::guido'

In [142]:
'guido' in val

True

In [143]:
val.index(',')

1

In [144]:
val.find(':')

-1

In [145]:
val.count(',')

2

In [146]:
val.replace(',', '::')

'a::b:: guido'

In [147]:
val.replace(',', '')

'ab guido'

In [148]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [149]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [150]:
data = pd.Series(data)

In [151]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [152]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [153]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [154]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                        [1,2,3,1,3,1,2,2,3]])

In [155]:
data

a  1    1.265936
   2   -0.866740
   3   -0.678886
b  1   -0.094709
   3    1.491390
c  1   -0.638902
   2   -0.443982
d  2   -0.434351
   3    2.205930
dtype: float64

In [156]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [157]:
data['b']

1   -0.094709
3    1.491390
dtype: float64

In [158]:
data['b':'d']

b  1   -0.094709
   3    1.491390
c  1   -0.638902
   2   -0.443982
d  2   -0.434351
   3    2.205930
dtype: float64

In [159]:
data.loc[['b', 'd']]

b  1   -0.094709
   3    1.491390
d  2   -0.434351
   3    2.205930
dtype: float64

In [160]:
data.loc[:, 2]

a   -0.866740
c   -0.443982
d   -0.434351
dtype: float64

In [161]:
data

a  1    1.265936
   2   -0.866740
   3   -0.678886
b  1   -0.094709
   3    1.491390
c  1   -0.638902
   2   -0.443982
d  2   -0.434351
   3    2.205930
dtype: float64

In [162]:
data.unstack()

          1         2         3
a  1.265936 -0.866740 -0.678886
b -0.094709       NaN  1.491390
c -0.638902 -0.443982       NaN
d       NaN -0.434351  2.205930

In [163]:
data.unstack().stack()

a  1    1.265936
   2   -0.866740
   3   -0.678886
b  1   -0.094709
   3    1.491390
c  1   -0.638902
   2   -0.443982
d  2   -0.434351
   3    2.205930
dtype: float64

In [164]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [165]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [166]:
frame.index.names = ['key1', 'key2']

In [167]:
frame.columns.names = ['state', 'color']

In [168]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [169]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']], names=['state', 'color'])

NameError: name 'MultiIndex' is not defined

In [ ]:
frame.swaplevel('key1', 'key2')

In [ ]:
frame.sort_index(level=1)

In [ ]:
frame.swaplevel(0, 1).sort_index(level=0)

In [ ]:
frame.sum(level='key2')

In [ ]:
frame.sum(level='color', axis=1)

In [ ]:
frame

In [ ]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1), 'c': 
                      ['one', 'one', 'one', 'two', 'two', 'two', 'two'], 
                      'd':[0,1,2,0,1,2,3]})

In [ ]:
frame

In [ ]:
frame2 = frame.set_index(['c', 'd'])

In [ ]:
frame2

In [ ]:
frame.set_index(['c', 'd'], drop=False)

In [ ]:
frame2.reset_index()

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2)

In [ ]:
pd.merge(df1, df2, on='key')

In [ ]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [ ]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [ ]:
df3

In [ ]:
df4

In [ ]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

In [ ]:
pd.merge(df1, df2, how='outer')

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2, on='key', how='left')

In [ ]:
pd.merge(df1, df2, how='inner')

In [ ]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'], 'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

In [ ]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'], 'key2': ['one', 'one', 'one', 'two'],
'rval': [4, 5, 6, 7]})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on = ['key1', 'key2'], how='outer')

In [ ]:
pd.merge(left, right, on='key1')

In [ ]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

In [ ]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [ ]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})

In [ ]:
left1

In [ ]:
right1

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True)

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

In [ ]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002], 'data': np.arange(5.)})

In [ ]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)), 
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [ ]:
lefth

In [ ]:
righth

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

In [ ]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],right_index=True, how='outer')

In [ ]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],
              columns=['Ohio', 'Nevada'])

In [ ]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]], index=['b', 'c', 'd', 'e'],
               columns=['Missouri', 'Alabama'])

In [ ]:
left2

In [ ]:
right2

In [ ]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

In [ ]:
left2.join(right2, how='outer')

In [ ]:
left1.join(right1, on='key')

In [ ]:
left1.join(right1, on='key')

In [ ]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]], index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])

In [ ]:
another

In [ ]:
left2.join([right2, another])

In [ ]:
left2.join([right2, another], how='outer')

In [ ]:
left2

In [ ]:
arr = np.arange(12).reshape((3, 4))

In [ ]:
arr

In [ ]:
np.concatenate([arr, arr], axis=1)

In [ ]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [ ]:
s1

In [ ]:
s2

In [ ]:
s3

In [ ]:
pd.concat([s1, s2, s3])

In [ ]:
pd.concat([s1, s2, s3], axis=1)

In [ ]:
s4 = pd.concat([s1, s3])

In [ ]:
s4

In [ ]:
pd.concat([s1, s4], axis=1)

In [ ]:
pd.concat([s1, s4], axis=1, join='inner')

In [ ]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])

In [ ]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])

In [ ]:
result

In [ ]:
result.unstack()

In [ ]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])

In [ ]:
df1= pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])

In [ ]:
df2=pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

In [ ]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)

In [ ]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'], 
          names=['upper', 'lower'])

In [ ]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [ ]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1, df2], ignore_index=True)

In [ ]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])

In [ ]:
b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

In [ ]:
a

In [ ]:
b

In [ ]:
b[-1] = np.nan

In [ ]:
b

In [ ]:
np.where(pd.isnull(a), b, a)

In [ ]:
b[:-2].combine_first(a[2:])

In [ ]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan], 'b': [np.nan, 2., np.nan, 6.],
'c': range(2, 18, 4)})

In [ ]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
'b': [np.nan, 3., 4., 6., 8.]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1.combine_first(df2)

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))

In [ ]:
data

In [ ]:
result = data.stack()

In [ ]:
result

In [ ]:
result.unstack()

In [ ]:
result.unstack(0)

In [ ]:
result.unstack('state')

In [ ]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [ ]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [ ]:
s1

In [ ]:
s2

In [ ]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [ ]:
data2

In [ ]:
data2.unstack()

In [ ]:
data2.unstack().stack()

In [ ]:
data2.unstack().stack(dropna=False)

In [ ]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))

In [ ]:
df

In [ ]:
df.unstack('state')

In [ ]:
df.unstack('state').stack('side')

In [ ]:
pivoted = ldata.pivot('date', 'item', 'value')

In [ ]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'], 'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})

In [ ]:
df

In [ ]:
melted = pd.melt(df, ['key'])

In [ ]:
melted

In [ ]:
reshaped = melted.pivot('key', 'variable', 'value')

In [ ]:
reshaped

In [ ]:
reshaped.reset_index()

In [ ]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

In [ ]:
pd.melt(df, value_vars=['A', 'B', 'C'])

In [ ]:
pd.melt(df, value_vars=['key', 'A', 'B'])